import requests
import pandas as pd

# print('---------------------------------requests---------------------------------------------')
# # requests - запросить данные с сайта и вывести их в консоль.
# query = {'q': 'wood floor'}
# # создадим переменную, которая будет содержать необходимые параметры
# # (q — передаём ключевые слова для поиска)
# res = requests.get('https://ru.pinterest.com/search/pins', params=query)
# # метод get, в ответе мы получим ссылку с нужными параметрами запроса
# print(res.ok)
# print(res.url)

# print('-----------------------------------pandas-------------------------------------------')
# 
# # Series
# my_series = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])
# 
# print(my_series)
# 
# my_series[['a', 'c']] = 999
# 
# print(my_series)
# print('------------------------------------------------------------------------------')
# 
# # DataFrame
# my_dict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
#            {'a': 100, 'b': 200, 'c': 300, 'd': 400},
#            {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
# df = pd.DataFrame(my_dict)
# print(df)
# 
# f_row = df.iloc[0]
# print(f_row)
# print('------------------------------------------------------------------------------')
# 
# 
# # Чтение данных из Excel файла
# xlsx = pd.ExcelFile('Календарь учебного года1.xlsx')
# data = pd.read_excel(xlsx, 'Календарь')
# print(data)
# print('------------------------------------------------------------------------------')




